app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 27], ["text", "nice"], ["created_at", "2023-08-03 00:02:05.051399"], ["updated_at", "2023-08-03 00:02:05.051399"]]
---
  def create
    @comment = @current_user.comments.new(comment_params)
    @comment[:post_id] = params[:post_id]

    if @comment.save