app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 10], ["created_at", "2023-07-29 14:37:48.463451"], ["updated_at", "2023-07-29 14:37:48.463451"]]
---
  def create
    @post = Post.find(params[:post_id])
    @like = @current_user.likes.new(post_id: @post.id)
    @like.author = @current_user
    if @like.save