app/controllers/posts_controller.rb

  def create
    @post = @current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"