app/models/post.rb

  def update_post_counter
    author.update(posts_counter: author.posts.all.count)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]